dokumentacja/edm/P1-DS-Dokumentacja_integracyjna_P1_EDM_20220915_W16/Załącznik nr 3 - Przykłady - wersja 1.16/generujToken/Przykład żądania wygenerowania tokena SAML.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                  xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512/" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
    <soapenv:Header>
        <wsse:Security mustUnderstand="1">
            <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="x509certificate">
                ...
            </wsse:BinarySecurityToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                ...
            </ds:Signature>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <wst:RequestSecurityToken>
            <wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType>
            <saml:AuthnStatement AuthnInstant="2019-08-26T09:22:00Z">
                <saml:AuthnContext>
                    <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml:AuthnContextClassRef>
                </saml:AuthnContext>
            </saml:AuthnStatement>
            <saml:AttributeStatement xmlns:xacmlprof="urn:oasis:names:tc:SAML:2.0:profiles:attribute:XACML" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
                                Name="urn:oasis:names:tc:SAML:attribute:subject-id"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
                    <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.1.6.2#3241138</saml:AttributeValue>
                </saml:Attribute>
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
                                Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
                    <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.2.3.1#000000001779</saml:AttributeValue>
                </saml:Attribute>
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
                                Name="urn:oasis:names:tc:xspa:1.0:subject:child-organization"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
                    <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.2.3.3#000000001779-039</saml:AttributeValue>
                </saml:Attribute>
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
                                Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
                    <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.1.1.616#94071712351</saml:AttributeValue>
                </saml:Attribute>
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
                                Name="urn:oasis:names:tc:xspa:1.0:subject:functional-role"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
                    <saml:AttributeValue xsi:type="xs:string">medical doctor</saml:AttributeValue>
                </saml:Attribute>
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
                                Name="urn:oasis:names:tc:xacml:1.0:action:action-id"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
                    <saml:AttributeValue xsi:type="xs:string">READ</saml:AttributeValue>
                </saml:Attribute>
                <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
                                Name="urn:oasis:names:tc:xacml:2.0:action:purpose"
                                xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
                    <saml:AttributeValue xsi:type="xs:string">RECORDMGT</saml:AttributeValue>
                </saml:Attribute>
            </saml:AttributeStatement>
        </wst:RequestSecurityToken>
    </soapenv:Body>
</soapenv:Envelope>